CSI API ETABS v1
cLoadPatterns.Add Method
 Adds a new load pattern.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Add(
	string Name,
	eLoadPatternType MyType,
	double SelfWTMultiplier = 0,
	bool AddAnalysisCase = true
)
Function Add (
	Name As String,
	MyType As eLoadPatternType,
	Optional SelfWTMultiplier As Double = 0,
	Optional AddAnalysisCase As Boolean = true
) As Integer
Dim instance As cLoadPatterns
Dim Name As String
Dim MyType As eLoadPatternType
Dim SelfWTMultiplier As Double
Dim AddAnalysisCase As Boolean
Dim returnValue As Integer
returnValue = instance.Add(Name, MyType,
	SelfWTMultiplier, AddAnalysisCase)
int Add(
	String^ Name,
	eLoadPatternType MyType,
	double SelfWTMultiplier = 0,
	bool AddAnalysisCase = true
)
abstract Add :
        Name : string *
        MyType : eLoadPatternType *
        ?SelfWTMultiplier : float *
        ?AddAnalysisCase : bool
(* Defaults:
        let _SelfWTMultiplier = defaultArg SelfWTMultiplier 0
        let _AddAnalysisCase = defaultArg AddAnalysisCase true
*)
-> int
Parameters
Name
Type: System.String
 The name for the new load pattern.
MyType
Type: ETABSv1.eLoadPatternType
 This is one of the items in the eLoadPatternType enumeration.
SelfWTMultiplier (Optional)
Type: System.Double
 The self weight multiplier for the new load pattern.
AddAnalysisCase (Optional)
Type: System.Boolean
 If this item is True, a linear static load case corresponding to the new load pattern is added.
Return Value
Type: Int32
 Returns 0 if the load pattern is successfully added; otherwise it returns nonzero.
Remarks
 An error is returned if the Name item is already used for an existing load pattern.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add new load pattern
       ret = SapModel.LoadPatterns.Add("LIVE1A", eLoadPatternType.Live)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLoadPatterns Interface
ETABSv1 Namespace